Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.67/samv70/edc/ATSAMV70N20.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M7" atdf:family="SAMV" edc:arch="arm32bit" edc:atsamname="ATSAMV70N20" edc:hasfreeze="false" edc:name="ATSAMV70N20" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.6" edc:minvoltage="1.62" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match" edc:irq="-12"/>
    <edc:Interrupt edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" edc:irq="-11"/>
    <edc:Interrupt edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition" edc:irq="-10"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="DebugMonitor" edc:desc="Debug Monitor" edc:irq="-4"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="SUPC" edc:desc="Supply Controller" edc:irq="0" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:cname="RSTC" edc:desc="Reset Controller" edc:irq="1" ltx:memberofperipheral="RSTC"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Clock" edc:irq="2" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="RTT" edc:desc="Real Time Timer" edc:irq="3" ltx:memberofperipheral="RTT"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watchdog Timer" edc:irq="4" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:cname="PMC" edc:desc="Power Management Controller" edc:irq="5" ltx:memberofperipheral="PMC"/>
    <edc:Interrupt edc:cname="EFC" edc:desc="Enhanced Embedded Flash Controller" edc:irq="6" ltx:memberofperipheral="EFC"/>
    <edc:Interrupt edc:cname="UART0" edc:desc="UART 0" edc:irq="7" ltx:memberofperipheral="UART0"/>
    <edc:Interrupt edc:cname="UART1" edc:desc="UART 1" edc:irq="8" ltx:memberofperipheral="UART1"/>
    <edc:Interrupt edc:cname="PIOA" edc:desc="Parallel I/O Controller A" edc:irq="10" ltx:memberofperipheral="PIOA"/>
    <edc:Interrupt edc:cname="PIOB" edc:desc="Parallel I/O Controller B" edc:irq="11" ltx:memberofperipheral="PIOB"/>
    <edc:Interrupt edc:cname="USART0" edc:desc="USART 0" edc:irq="13" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:cname="USART1" edc:desc="USART 1" edc:irq="14" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:cname="USART2" edc:desc="USART 2" edc:irq="15" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:cname="PIOD" edc:desc="Parallel I/O Controller D" edc:irq="16" ltx:memberofperipheral="PIOD"/>
    <edc:Interrupt edc:cname="HSMCI" edc:desc="Multimedia Card Interface" edc:irq="18" ltx:memberofperipheral="HSMCI"/>
    <edc:Interrupt edc:cname="TWIHS0" edc:desc="Two Wire Interface 0 HS" edc:irq="19" ltx:memberofperipheral="TWIHS0"/>
    <edc:Interrupt edc:cname="TWIHS1" edc:desc="Two Wire Interface 1 HS" edc:irq="20" ltx:memberofperipheral="TWIHS1"/>
    <edc:Interrupt edc:cname="SPI0" edc:desc="Serial Peripheral Interface 0" edc:irq="21" ltx:memberofperipheral="SPI0"/>
    <edc:Interrupt edc:cname="SSC" edc:desc="Synchronous Serial Controller" edc:irq="22" ltx:memberofperipheral="SSC"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer/Counter 0" edc:irq="23" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer/Counter 1" edc:irq="24" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC2" edc:desc="Timer/Counter 2" edc:irq="25" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC3" edc:desc="Timer/Counter 3" edc:irq="26" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC4" edc:desc="Timer/Counter 4" edc:irq="27" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC5" edc:desc="Timer/Counter 5" edc:irq="28" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="AFEC0" edc:desc="Analog Front End 0" edc:irq="29" ltx:memberofperipheral="AFEC0"/>
    <edc:Interrupt edc:cname="DACC" edc:desc="Digital To Analog Converter" edc:irq="30" ltx:memberofperipheral="DACC"/>
    <edc:Interrupt edc:cname="PWM0" edc:desc="Pulse Width Modulation 0" edc:irq="31" ltx:memberofperipheral="PWM0"/>
    <edc:Interrupt edc:cname="ICM" edc:desc="Integrity Check Monitor" edc:irq="32" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:cname="ACC" edc:desc="Analog Comparator" edc:irq="33" ltx:memberofperipheral="ACC"/>
    <edc:Interrupt edc:cname="USBHS" edc:desc="USB Host / Device Controller" edc:irq="34" ltx:memberofperipheral="USBHS"/>
    <edc:Interrupt edc:cname="MCAN0_INT0" edc:desc="MCAN Controller 0 Interrupt 0" edc:irq="35" ltx:memberofperipheral="MCAN0"/>
    <edc:Interrupt edc:cname="MCAN0_INT1" edc:desc="MCAN Controller 0 Interrupt 1" edc:irq="36" ltx:memberofperipheral="MCAN0"/>
    <edc:Interrupt edc:cname="MCAN1_INT0" edc:desc="MCAN Controller 1 Interrupt 0" edc:irq="37" ltx:memberofperipheral="MCAN1"/>
    <edc:Interrupt edc:cname="MCAN1_INT1" edc:desc="MCAN Controller 1 Interrupt 1" edc:irq="38" ltx:memberofperipheral="MCAN1"/>
    <edc:Interrupt edc:cname="AFEC1" edc:desc="Analog Front End 1" edc:irq="40" ltx:memberofperipheral="AFEC1"/>
    <edc:Interrupt edc:cname="TWIHS2" edc:desc="Two Wire Interface 2 HS" edc:irq="41" ltx:memberofperipheral="TWIHS2"/>
    <edc:Interrupt edc:cname="QSPI" edc:desc="Quad I/O Serial Peripheral Interface" edc:irq="43" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:cname="UART2" edc:desc="UART 2" edc:irq="44" ltx:memberofperipheral="UART2"/>
    <edc:Interrupt edc:cname="UART3" edc:desc="UART 3" edc:irq="45" ltx:memberofperipheral="UART3"/>
    <edc:Interrupt edc:cname="UART4" edc:desc="UART 4" edc:irq="46" ltx:memberofperipheral="UART4"/>
    <edc:Interrupt edc:cname="TC6" edc:desc="Timer/Counter 6" edc:irq="47" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TC7" edc:desc="Timer/Counter 7" edc:irq="48" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TC8" edc:desc="Timer/Counter 8" edc:irq="49" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TC9" edc:desc="Timer/Counter 9" edc:irq="50" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:cname="TC10" edc:desc="Timer/Counter 10" edc:irq="51" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:cname="TC11" edc:desc="Timer/Counter 11" edc:irq="52" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:cname="MLB" edc:desc="MediaLB" edc:irq="53" ltx:memberofperipheral="MLB"/>
    <edc:Interrupt edc:cname="AES" edc:desc="AES" edc:irq="56" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="57" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:cname="XDMAC" edc:desc="DMA" edc:irq="58" ltx:memberofperipheral="XDMAC"/>
    <edc:Interrupt edc:cname="ISI" edc:desc="Camera Interface" edc:irq="59" ltx:memberofperipheral="ISI"/>
    <edc:Interrupt edc:cname="PWM1" edc:desc="Pulse Width Modulation 1" edc:irq="60" ltx:memberofperipheral="PWM1"/>
    <edc:Interrupt edc:cname="FPU" edc:desc="Floating Point Unit" edc:irq="61" ltx:memberofperipheral="FPU"/>
    <edc:Interrupt edc:cname="RSWDT" edc:desc="Reinforced Secure Watchdog Timer" edc:irq="63" ltx:memberofperipheral="RSWDT"/>
    <edc:Interrupt edc:cname="CCW" edc:desc="Cache ECC Warning" edc:irq="64" ltx:memberofperipheral="SystemControl"/>
    <edc:Interrupt edc:cname="CCF" edc:desc="Cache ECC Fault" edc:irq="65" ltx:memberofperipheral="SystemControl"/>
    <edc:Interrupt edc:cname="IXC" edc:desc="Floating Point Unit IXC" edc:irq="68" ltx:memberofperipheral="FPU"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="ACC" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="AFEC0" edc:desc=""/>
    <edc:Peripheral edc:cname="AFEC1" edc:desc=""/>
    <edc:Peripheral edc:cname="CHIPID" edc:desc=""/>
    <edc:Peripheral edc:cname="EFC" edc:desc=""/>
    <edc:Peripheral edc:cname="GPBR" edc:desc=""/>
    <edc:Peripheral edc:cname="HSMCI" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="ISI" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="MCAN0" edc:desc=""/>
    <edc:Peripheral edc:cname="MCAN1" edc:desc=""/>
    <edc:Peripheral edc:cname="MLB" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOA" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOB" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOD" edc:desc=""/>
    <edc:Peripheral edc:cname="PMC" edc:desc=""/>
    <edc:Peripheral edc:cname="PWM0" edc:desc=""/>
    <edc:Peripheral edc:cname="PWM1" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSWDT" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTT" edc:desc=""/>
    <edc:Peripheral edc:cname="SPI0" edc:desc=""/>
    <edc:Peripheral edc:cname="SSC" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS0" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS1" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS2" edc:desc=""/>
    <edc:Peripheral edc:cname="UART0" edc:desc=""/>
    <edc:Peripheral edc:cname="UART1" edc:desc=""/>
    <edc:Peripheral edc:cname="UART2" edc:desc=""/>
    <edc:Peripheral edc:cname="UART3" edc:desc=""/>
    <edc:Peripheral edc:cname="UART4" edc:desc=""/>
    <edc:Peripheral edc:cname="USART0" edc:desc=""/>
    <edc:Peripheral edc:cname="USART1" edc:desc=""/>
    <edc:Peripheral edc:cname="USART2" edc:desc=""/>
    <edc:Peripheral edc:cname="USBHS" edc:desc=""/>
    <edc:Peripheral edc:cname="UTMI" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="XDMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="LOCKBIT" edc:desc=""/>
    <edc:Peripheral edc:cname="DACC" edc:desc=""/>
    <edc:Peripheral edc:cname="SCnSCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xFF00FDFF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnn-------nnnn----------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF80F0000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------rrrrrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----rrr--------rrrrrr----------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x700FC00" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="FAULTMASK" edc:desc="Fault Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="92" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="BASEPRI" edc:desc="Base Priority Mask Register" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="96" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------------nnn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x400E1EE8" edc:regionid="PERIPHERALS" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x40000000" edc:access="------------------------w---wwww" edc:cname="HSMCI_CR" edc:impl="0x8F" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="MCIEN" edc:desc="Multi-Media Interface Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCIDIS" edc:desc="Multi-Media Interface Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWSEN" edc:desc="Power Save Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWSDIS" edc:desc="Power Save Mode Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000004" edc:access="---------------n-nnnnnnnnnnnnnnn" edc:cname="HSMCI_MR" edc:impl="0x17FFF" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="Clock Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PWSDIV" edc:desc="Power Saving Divider" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="RDPROOF" edc:desc="Read Proof Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRPROOF" edc:desc="Write Proof Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FBYTE" edc:desc="Force Byte Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADV" edc:desc="Padding Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKODD" edc:desc="Clock divider is odd" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
