Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.67/samv70/edc/ATSAMV70N20.PIC
      <edc:SFRDef edc:_addr="0x40034094" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="MCAN1_HPMS" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="BIDX" edc:desc="Buffer Index" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:desc="Message Storage Indicator" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_FIFO_SEL" edc:desc="No FIFO selected." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_0" edc:desc="Message stored in FIFO 0." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_1" edc:desc="Message stored in FIFO 1." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:desc="Filter Index" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:desc="Filter List" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_NDAT1" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND0" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:desc="New Data" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003409C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_NDAT2" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND32" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:desc="New Data" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
